In [7]:
import pandas as pd
from pandas import Series
from pandas import DataFrame

import numpy as np

In [12]:
data_url = 'http://bit.ly/movieusers' #Data URL
df = pd.read_csv(data_url, sep='|', header = None)

In [13]:
df.columns = [
    'NUM','AGE', 'GENDER', 'JOB', 'CODE'] 
df.head()

   NUM  AGE GENDER         JOB   CODE
0    1   24      M  technician  85711
1    2   53      F       other  94043
2    3   23      M      writer  32067
3    4   24      M  technician  43537
4    5   33      F       other  15213

In [14]:
df.describe()

              NUM         AGE
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [18]:
df.GENDER.unique()

array(['M', 'F'], dtype=object)

In [20]:
df.GENDER.replace(
    {"M":0, "F":1}
).head()

0    0
1    1
2    0
3    0
4    1
Name: GENDER, dtype: int64

In [21]:
df.GENDER.head(5)

0    M
1    F
2    M
3    M
4    F
Name: GENDER, dtype: object

In [23]:
df.GENDER.replace(
["M","F"],
[0,1],inplace=True)

In [25]:
df.head()

   NUM  AGE  GENDER         JOB   CODE
0    1   24       0  technician  85711
1    2   53       1       other  94043
2    3   23       0      writer  32067
3    4   24       0  technician  43537
4    5   33       1       other  15213